In [27]:
import pandas as pd

Arreglar el df ratings

In [28]:
df_ratings = pd.read_csv("./data/ratings.csv")
df_ratings.drop(columns="Unnamed: 0", inplace=True)

In [29]:
df_ratings.loc[153]

title     The Razor's Edge
rating                 7.3
Name: 153, dtype: object

In [30]:
df_ratings[df_ratings.duplicated(['title', 'rating'])]

                title  rating
151               NaN     NaN
154  The Razor's Edge     7.3
175               NaN     NaN
201               NaN     NaN
253               NaN     NaN
287               NaN     NaN
309               NaN     NaN
370               NaN     NaN
562               NaN     NaN

In [31]:
df_ratings = df_ratings.drop(154)

# Restablecer el índice después de eliminar la fila
df_ratings = df_ratings.reset_index(drop=True)

In [32]:
df_ratings[df_ratings.duplicated(['title', 'rating'])]

    title  rating
151   NaN     NaN
174   NaN     NaN
200   NaN     NaN
252   NaN     NaN
286   NaN     NaN
308   NaN     NaN
369   NaN     NaN
561   NaN     NaN

In [35]:
df_ratings

                   title  rating
0             The Racket     6.6
1             7th Heaven     7.6
2                  Wings     7.5
3                  Alibi     5.7
4         In Old Arizona     5.5
..                   ...     ...
586        The Fabelmans     7.5
587                  Tár     7.4
588    Top Gun: Maverick     8.3
589  Triangle of Sadness     7.3
590        Women Talking     6.9

[591 rows x 2 columns]

In [34]:
df_ratings.to_csv("./data/ratings.csv", index=False)

In [ ]:
df_ratings